package com.javarush.task.task01.task0104;

/**
 * Created by noliv_000 on 05.10.2014.
 */
/* Амиго очень умный
Написать программу, выводящую на экран надпись «Амиго очень умный».
*/
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Амиго очень умный");
    }
}